{
    "blog": [
        {
            "id": "01",
            "date":"Oct 24",
            "text":"Like why is it that what I love is also what I am afraid of. I am extremely tired of running away from my responsibilities, of kindness and of love. I forgive but people don't really forget that I am weird, I am strange and I am tired and silent, or I stare at a girl I could never get. Its kinda tough talking to everyone to make a judgement. You never really get a chance to talk to everyone and understand everything. Its kinda sad a smile is not enough. Everyone really wants is humanity and understanding. No one really has the time or burden of understanding everything.. Ignorance is a sort of heaven on earth x___x.. decisions are easier, emotions are easier, actions are easier, people are easier, kindness is easier, forgiving accrued historical debt is easier."
        },
        {
            "id":"02",
            "date":"May 22",
            "text": "I think it is important to keep swimming and be who you are and determine where you want to go. It is not necessarily imperative that others understand. Still, I must know what my happiness is and continue to learn that. I think it was important that I found my stupid fixation with finding love and belonging. Marriage, children and that compensation of fulfilment that matters to me. It is not necessary for me to ‘suck it’ to make it but kinda understand standing your ground and continue moving forward with finding happiness, not at the expense of others or yourself. That thick understanding of clarity that booty doesn’t get you much but that understanding of laughter and of happiness of a best friend. That imperative of unrestrictive choice in pursuit of finding that job and future that makes you who you are, undefinitive of others self-validation.It is hard to move on, as is our nature of this stupid human condition. Still, I must understand that the only one who is restricting myself is my own definition. I don’t think I can impose limits on another person as a definition of my values. Why do I limit myself? I will not accept that competitiveness of seeking and imposing, and that stupidity of laziness of sleeping in and dwelling on a past that does not care for me much, but continuing into a future that will accept me is self-important rather than imposing. "
        },
        {
            "id":"03",
            "date":"April 2",
            "text":"Not being able to tell what is real is kinda the worst. When I volunteered at a transition facility for seniors all you could do is be present and do your best but you can see feel and hear all those inner battles. Not knowing why how or when where they are. Being trapped in more walls than you can imagine. It forced me and prepared me for my own battles with myself. Sinking into my own mind creating these illustrations that are all too real but not being able to measure anything. Questioning judgements for everything, worrying about everything. For me, it was relationships with other people and working about other perceptions of reality. Am I an asshole, did I say the wrong things, did I come on too strong, maybe I am too fat. It doesn’t seem like much but when it plays over and over again. PTSD like rebounds that causes you to shout; you’re probably not doing so well. It’s kinda like running around the world with more weights than you have to, a gravity that sometimes forces you to crawl when others run. I learned from experience, the challenges that you have to face are just in your mind and force yourself to let go. Accepting sounds like bullshit, but when it is every day all the time, you have to. When it gets too much you kinda need help to be able to sink below the tide and cut through the momentum. I didn’t survive because of strength, it was because of my fear of what my reality was. Not know between life and death; not in the actual sense but limbo. One time I was on the verge of pushing to the dark side but it had too much resistance. On some level, it was because of my friends, and family that I worried about. What if I just got up and left.. would they be okay? Would I be okay with that if they weren’t okay? Lol, would I be okay if they were happy? It’s kinda about doing my best and flows with the path of less resistance.. maybe going with things that aren’t so bad, fight what is dark and difficult and finding what I was raised to be true. I went with what kept us alive as a race. Not ill will and disgrace but changes and ebbs and flows of my self. Accepting and not fighting, happy and crying, listening and not hearing, kinda living and dying without actually dying. I find if I fight it, my feelings take me like a wave. If I sink a bit it kinda works out. But when it doesn’t work out I walk or I ignore then approach the problem differently. Just know what bothers you or the foresight of what you will feel kinda gives you control. I think it is just experience of putting on different hats and environments.Also helps that your parents are kinda crazy to.. might just be about having Asian parents that grew up in war zones."  
        },
        {
            "id":"04",
            "date":"Oct 5",
            "text":"Love. It’s terrible and awesome...I was on anti-anxiety, bridging me into my first fully fledged relationship. I grew more into responsibility and expectation of manliness. I took care of my partner, played it coy for the first bit, then we started living together for the next 2 yrs. I thought maybe we will get married. It was cool, we took turns making dinner. Really made time to surprise and delight each other (or whatever the buzz word is now). I basically became a really fat happy fuck. She joked that there was an effort to fatten me up so other girls wouldn’t steal me even though we would rip each other apart during fights. Then the next morning it would be resolved. I kinda forced myself to fix it and promise not to go to bed angry. A lot of stuff was confided in each other and kinda help pull each other through our university degrees. We met awkwardly studying hearts, listen to each other's chest. It came to her turn to listen. My heart was beating pretty slow then the attraction/adrenaline started to kick in. Kinda went from there. The anti-anxiety medication helped break the ice for me to kinda reach out. Eventually, I got confident enough to creep off the medication, going off my training wheels. The trouble came from stresses of leaving for our separate families and finding our own thing. Some problems came from becoming each others identity. It got to the point of getting “husband and wife face.” Will Smith (Yes the actor haha) said, “in a relationship, it is your responsibility to fill your cup with who you are (friends, families, goals, hobbies) and not be a beggar.” Kinda be who you want to be and not lose your identity in someone else. Causing strain, pouring each other into each others cup. I think this is additive to how people are; fluid, difficult to put in a box. I think people move together than being contained too strongly... Everything on an individual level has to be a choice. Anyways... We got argumentative. Fighting each other to bend rather than compromising and free-flowing to what each other wants. For the first time, we went to bed angry. It got so confrontational and uncompromising, I gave up. It was obvious each other was entrenched. I became “Silent Bob” and let us fail as a couple. Once she finally said we were done, it felt like something was cut out of me. Putting a stone in my throat and wrapping my stomach around a knife. Then it went out. Everything went out. (Didn’t help that she went back to her ex right after.) The numbness was welcomed for a bit but it wasn’t sustainable. It wasn’t anything. Emotions became a deafening silence and the good memories haunting. So I chased vices, physical and non-physical, alcohol, prescription and non-prescription. (Binged read books from day to night, excessive sleeping being lost in dreams, food, classic alcohol use, writing, simple physical contact, locking myself in the gym getting lost in the pain, or just straight forward antidepressants, stressful jobs). Some part of me felt if I conquered a mountain she would come back. If I could land a good job in making a difference.. could change it all. So it helped me going (somewhat) in jobs with stress. But she got married, so yeah. I was a bit upset but I still consider her a friend and someone who changed me for the worse and better. She still pushed me to achieve whether I was with her or not, developing confidence and health that I wouldn’t have otherwise. I had built a mesh of friends, more direction in my job, and confidence mostly.. my cup is fuller and relationships are treated in stride."
        },
        {
            "id": "05",
            "date": "Oct 1",
            "text": "My volunteer work in senior health care was pretty educational. I saw a lot learned a lot, taught me values in stories and commonality between individuals. I was studying psychology at the time and was interested in health care and senior psychology so I applied to my local hospital. I was put into their assessment centre where people were transitioning from independence :( Even some parts of functionality are being lost there was an emotional impact to their memories that are meaningful. Sometimes it is just presence, sometimes it is their legacy, sometimes it is about tragedies that they went through. There is always some aspect to their individuality that is interesting. One senior wanted me to be his driver for his Bentley, some just wanted friendship in their difficult times, others just wanted me to hear their stories. Some stories I found it to be funny how people were knowledgable about their field that they were successful in. One cow farmer couldn’t explain how he picks cows. After asking him several times about indicators, he got angry and just spat out he just knew what triple-A beef looked like. I am not entirely sure if it was just word finding difficulty, but usually, they could say a little bit about their expertise. He had a big property and a yacht so I am assuming he isn’t full of shit… Or maybe how he was brought into the hospital kinda gave him a pretence of paranoia.. anyways… One time I met a retired diplomat that just was really kind and said nothing really incorrect but also really didn’t say anything with direction. So it was a pretty interesting conversation but did teach me about the value of small gifts and genuine nature of the interaction. Another time I met with a senior that could probably shit gold if he had to. Iono, apparently he got lucky in 50/50 chance investments that made him incredibly successful. I think it helped that he had a feeling of confidence of a well-lived life that he didn’t really give a shit whether you believed him or not. He wasn’t cocky but just a genuine gentleman. He built condos, apartment buildings, strip malls, creating a giant investment fund, and generous donations in a section of the hospital we were conversing in. He talked with confidence and required you to be on your toes the whole time. It was like a lecture, and in payment, I talked about stocks I thought were pretty good and technologies that were new. He taught me a lot of cool things. Some were common sensicle, some not so much.  Like how to be cautious if I had to, which I incorporated into my secret sauce. Also, which risks taking. Sometimes he said he would guess the probability like how a chef knew how much salt to add to a dish without measuring, other times he would kinda just go for it. So yeah, he had a golden horseshoe up his arse. Another person taught me how to be confident with what I believed. She was deeply religious and you can tell by everything in her room, and how she ate. It was cool that she never really talked about it or wouldn’t actually say anything about her beliefs. She didn’t have to convince anyone but her self in what she believed. I asked her one day about her religion and what she was reading and the meaning to it. She said, “it was my little secret.” I continued to ask why is it so hard to read, and she continued to say it brings yourself to the text and makes it interesting every time. In other words, it's important to accept different values and beliefs when they are entrenched. I think the difficulty is finding relative statements that become understood from all perspectives though. I think it is pretty cool that we all go through the same things but certain occurrences become more prominent with who we are. I think its kinda upsetting given the lives they lived that they still chase and reminisce the past. Kinda making the best days the most haunting. In summary, I think it is our responsibility as their legacy to celebrate who they are now and say everything is okay and thanks."
        }
    ]
}